InformationRegisters/НастройкиВводаНаОсновании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВводаНаОсновании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбъекта</Name>
					<Comment>Например, "Обработка.ЗаполнениеКонтрагентов"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РезервированиеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>РезервированиеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТоваровОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходноеМестоРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеМестоРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаданиеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаданиеНаРаботу</Name>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаданияНаРаботу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаданиеНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеВидаРабот</Name>
					<Comment>Положение вида работ (в шапке, в списке)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/СозданиеНаОснованииКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// АПК:299-выкл для использования из менеджеров документов.

// Открывает форму для настройки перечня видимых команд
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ОткрытьФормуНастройкиПунктовСозданияНаОсновании(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	ДополнительныеПараметры = ПараметрыВыполненияКоманды.ОписаниеКоманды.ДополнительныеПараметры;
	ПараметрыФормы = Новый Структура("ПолноеИмяОбъекта");
	Если ДополнительныеПараметры.Свойство("ПолноеИмяОбъекта") Тогда   
		ПараметрыФормы.ПолноеИмяОбъекта = ПараметрыВыполненияКоманды.ОписаниеКоманды.ДополнительныеПараметры.ПолноеИмяОбъекта;
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.НастройкиВводаНаОсновании.Форма.ФормаНастройки", ПараметрыФормы);    
КонецПроцедуры        

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументЗаказПокупателяВвестиФактическийПлатеж(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Источник);
	
	Если ПараметрыВыполненияКоманды.Форма.Элементы.Найти("РедактироватьСписком") <> Неопределено
		И ПараметрыВыполненияКоманды.Форма.Объект.ЗапланироватьОплату Тогда
		
		Если ПараметрыВыполненияКоманды.Форма.Элементы.РедактироватьСписком.Пометка Тогда
			ПлатежныйКалендарьТекущаяСтрока = ПараметрыВыполненияКоманды.Форма.Элементы.СписокПлатежныйКалендарь.ТекущиеДанные;
		ИначеЕсли ПараметрыВыполненияКоманды.Форма.Объект.ПлатежныйКалендарь.Количество() > 0 Тогда
			ПлатежныйКалендарьТекущаяСтрока = ПараметрыВыполненияКоманды.Форма.Объект.ПлатежныйКалендарь[0];
		КонецЕсли;
		
		Если ПлатежныйКалендарьТекущаяСтрока <> Неопределено Тогда
			
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("Основание", Источник);
			СтруктураЗаполнения.Вставить("НомерСтроки", ПлатежныйКалендарьТекущаяСтрока.НомерСтроки);
			ПараметрыФормы.Вставить("Основание", СтруктураЗаполнения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТипДенежныхСредств = СозданиеНаОснованииВызовСервера.ЗначениеРеквизитаТипДенежныхСредств(Источник);
	Если ТипДенежныхСредств = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		ИмяФормы = "Документ.ПоступлениеВКассу.ФормаОбъекта";
	Иначе
		ИмяФормы = "Документ.ПоступлениеНаСчет.ФормаОбъекта";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы,
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Форма);
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.ВвестиФактическийПлатеж",
		ПараметрыВыполненияКоманды.Форма);    
		
КонецПроцедуры        

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументЗаказПоставщикуПоКалькуляции(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ЗаказПокупателя", Источник);
	ДанныеЗаполнения.Вставить("ПоКалькуляции", Истина);
	
	ПараметрыФормы = Новый Структура("Основание", ДанныеЗаполнения);
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Форма);
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.ЗаказПоставщикуПоКалькуляции",
		ПараметрыВыполненияКоманды.Источник);
		
КонецПроцедуры        

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументЗаказыПоставщикамБизнесСеть(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ПараметрыКоманды", ПараметрыВыполненияКоманды.МассивСсылок);
	ОткрытьФорму("Обработка.ТорговыеПредложения.Форма.ПоискПоТоварам",
		СтруктураРеквизитов,
		ПараметрыВыполненияКоманды.Форма);
		
КонецПроцедуры      
	
// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументПриходнаяНакладнаяПриемВПереработку(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   

	СтруктураЗаполнения = Новый Структура("Основание", Источник);
	ОткрытьФорму("Документ.ПриходнаяНакладная.ФормаОбъекта", СтруктураЗаполнения);
		
КонецПроцедуры        

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументСборкаЗапасовЧастичныйВыпуск(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Источник);
	ПараметрыФормы.Вставить("ИмяМенеджераДокумента","СборкаЗапасов");
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(
	"СоздатьСборкаЗапасовЗаказовПослеУточнения",
	ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.СозданиеНаОснованииУточнениеКоличества",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Форма,,,,
		ОписаниеОповещенияОЗакрытии);
		
КонецПроцедуры  

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументЗаказНаПроизводствоИерархический(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Источник);
	ПараметрыФормы.Вставить("ИмяМенеджераДокумента","ГрупповоеСоздание");
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(
	"СоздатьСборкаЗапасовЗаказовПослеУточнения",
	ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.СозданиеНаОснованииУточнениеКоличества",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Форма,,,,
		ОписаниеОповещенияОЗакрытии);
		
КонецПроцедуры       
	
// Открывает форму созданного на основании документа
// 
// Параметры:
//   Результат - Структура - сведения о выбранных параметрах количества
//       * АдресТовары - Строка - адрес сохраненной таблицы
//       * Основание - ДокументСсылка - ссылка на документ-основание
//       * КоличествоИзделий - Число - указанное количество
//   ДополнительныеПараметры - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура СоздатьСборкаЗапасовЗаказовПослеУточнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура();
	Основание.Вставить("АдресТовары", Результат.АдресТовары);
	Основание.Вставить("Основание", Результат.Основание);
	
	ПараметрыОткрытия = Новый Структура("Основание", Основание);
	
		ОткрытьФорму("Документ.СборкаЗапасов.Форма.ФормаДокумента",
		ПараметрыОткрытия,
		,
		Новый УникальныйИдентификатор);
	
КонецПроцедуры

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументРезервированиеСнятьРезерв(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ДокументЗаполнения", Источник);
	СтруктураЗаполнения.Вставить("СнятьРезерв", Истина);
	
	ОткрытьФорму("Документ.РезервированиеЗапасов.ФормаОбъекта", Новый Структура("Основание", СтруктураЗаполнения));
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.РезервированиеСнятьСоздатьНаОсновании",
		ПараметрыВыполненияКоманды.Источник);
		
КонецПроцедуры       

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ДокументЗаданиеНаРаботуКоманда(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт 
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ДанныеФормыСтруктура") Тогда
	  	// Запуск из формы документа
		СтруктураЗаполнения = Новый Структура();
		СтруктураЗаполнения.Вставить("Организация", ПараметрыВыполненияКоманды.Источник.Организация);
		СтруктураЗаполнения.Вставить("ВидЦен", ПараметрыВыполненияКоманды.Источник.ВидЦен);
		Если ПараметрыВыполненияКоманды.Источник.Свойство("ВидРабот") Тогда
			СтруктураЗаполнения.Вставить("ВидРабот", ПараметрыВыполненияКоманды.Источник.ВидРабот);
		КонецЕсли;
		
		СтруктураЗаполнения.Вставить("СтруктурнаяЕдиница", ПараметрыВыполненияКоманды.Источник.СтруктурнаяЕдиницаПродажи);
		
		РаботыТекущаяСтрока = Неопределено;
		ЗапасыТекущаяСтрока = Неопределено;
		Если ПараметрыВыполненияКоманды.Источник.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд") Тогда
			РаботыТекущаяСтрока = ПараметрыВыполненияКоманды.Форма.Элементы.Работы.ТекущиеДанные;
			СтруктураЗаполнения.Вставить("ВидРабот", ПараметрыВыполненияКоманды.Источник.ВидРабот);
		Иначе
			ЗапасыТекущаяСтрока = ПараметрыВыполненияКоманды.Форма.Элементы.Запасы.ТекущиеДанные;
		КонецЕсли;
		
		Если ЗапасыТекущаяСтрока <> Неопределено И НЕ ЗапасыТекущаяСтрока.ТипНоменклатурыЗапас Тогда
			
			СтруктураСтрока = Новый Структура;
			СтруктураСтрока.Вставить("Номенклатура", ЗапасыТекущаяСтрока.Номенклатура);
			СтруктураСтрока.Вставить("Характеристика", ЗапасыТекущаяСтрока.Характеристика);
			СтруктураСтрока.Вставить("День", ЗапасыТекущаяСтрока.ДатаОтгрузки);
			СтруктураСтрока.Вставить("Цена", ЗапасыТекущаяСтрока.Цена);
			СтруктураСтрока.Вставить("Сумма", ЗапасыТекущаяСтрока.Сумма);
			СтруктураСтрока.Вставить("Заказчик", ПараметрыВыполненияКоманды.Источник.Ссылка);
			
			Массив = Новый Массив;
			Массив.Добавить(СтруктураСтрока);
			
			СтруктураЗаполнения.Вставить("Работы", Массив);
			
		ИначеЕсли РаботыТекущаяСтрока <> Неопределено Тогда
			
			СтруктураСтрока = Новый Структура;
			СтруктураСтрока.Вставить("ВидРабот", РаботыТекущаяСтрока.ВидРабот);
			СтруктураСтрока.Вставить("Номенклатура", РаботыТекущаяСтрока.Номенклатура);
			СтруктураСтрока.Вставить("Характеристика", РаботыТекущаяСтрока.Характеристика);
			СтруктураСтрока.Вставить("День", ПараметрыВыполненияКоманды.Источник.Старт);
			
			ДлительностьВЧасах = РаботыТекущаяСтрока.Количество * РаботыТекущаяСтрока.Кратность * РаботыТекущаяСтрока.Коэффициент;
			Если ДлительностьВЧасах >= 24 Тогда
				ДлительностьВЧасах = (КонецДня(ПараметрыВыполненияКоманды.Источник.Старт) - ПараметрыВыполненияКоманды.Источник.Старт) / 3600;
			КонецЕсли;  
			
			СтруктураСтрока.Вставить("ДлительностьВЧасах", ДлительностьВЧасах);
			
			ДлительностьВСекундах = ДлительностьВЧасах * 3600;
			Часы = Цел(ДлительностьВСекундах / 3600);
			Минуты = (ДлительностьВСекундах - Часы * 3600) / 60;
			Длительность = Дата(0001, 01, 01, Часы, Минуты, 0);
			СтруктураСтрока.Вставить("Длительность", Длительность);
			
			Старт = Дата(0001, 01, 01, Час(ПараметрыВыполненияКоманды.Источник.Старт), Минута(ПараметрыВыполненияКоманды.Источник.Старт), 0);
			СтруктураСтрока.Вставить("ВремяНачала", Старт);
			СтруктураСтрока.Вставить("ВремяОкончания", Старт + ДлительностьВЧасах * 3600);
			
			СтруктураСтрока.Вставить("Цена", РаботыТекущаяСтрока.Цена);
			СтруктураСтрока.Вставить("Сумма", РаботыТекущаяСтрока.Сумма);
			СтруктураСтрока.Вставить("Заказчик", ПараметрыВыполненияКоманды.Источник.Ссылка);
			
			Массив = Новый Массив;
			Массив.Добавить(СтруктураСтрока);
			
			СтруктураЗаполнения.Вставить("Работы", Массив);
			
			МассивСтрокИсполнители = ПараметрыВыполненияКоманды.Источник.Исполнители.НайтиСтроки(Новый Структура("КлючСвязи", РаботыТекущаяСтрока.КлючСвязи));
			Для каждого СтрокаИсполнители Из МассивСтрокИсполнители Цикл
				СтруктураЗаполнения.Вставить("Сотрудник", СтрокаИсполнители.Сотрудник);
				Прервать;
			КонецЦикла;
			
		Иначе
			
			СтруктураСтрока = Новый Структура;
			СтруктураСтрока.Вставить("Заказчик", ПараметрыВыполненияКоманды.Источник.Ссылка);
			
			Массив = Новый Массив;
			Массив.Добавить(СтруктураСтрока);
			
			СтруктураЗаполнения.Вставить("Работы", Массив);
		КонецЕсли; 
	Иначе
		// запуск из формы списка
		СтруктураЗаполнения = Источник;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаданиеНаРаботу.ФормаОбъекта", Новый Структура("Основание", СтруктураЗаполнения));
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.КомандаЗаданиеНаРаботуСоздатьНаОсновании",
		ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура СозданиеСвязанныхОбъектов(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   

	ВходныеПараметры = Новый Структура;  
	ВходныеПараметры.Вставить("Источник", ПараметрыВыполненияКоманды.Форма);
	ДополнительныеОтчетыИОбработкиКлиент.ОткрытьФормуКомандДополнительныхОтчетовИОбработок(
		Источник,
		ВходныеПараметры,
		ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиСозданиеСвязанныхОбъектов());
		
КонецПроцедуры       

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ЧекКоррекции(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	ДокументОснование = Источник;
	
	// Для предотвращения повторного открытия форм ввода чека коррекции по одному Документу расчетов
	// назначается ключ уникальности в виде УникальныйИдентификатора документа расчетов
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЧекККМКоррекции") Тогда
		
		РеквизитыОснования = СозданиеНаОснованииВызовСервера.ЗначенияРеквизитовЧека(ДокументОснование);
		
		Если РеквизитыОснования.НеприменениеККТ Тогда
			ДокументРасчетов = ДокументОснование;
		Иначе
			ДокументРасчетов = РеквизитыОснования.ДокументРасчетов;
		КонецЕсли;
		
	Иначе
		
		ДокументРасчетов = ДокументОснование;
		
	КонецЕсли;
	
	КлючУникальности = ДокументРасчетов.УникальныйИдентификатор();
	
	ПараметрыФормы = Новый Структура("ДокументОснование", ДокументОснование);
	
	ОткрытьФорму("Обработка.СозданиеЧековКоррекции.Форма",
					ПараметрыФормы,
					,
					КлючУникальности,
					ПараметрыВыполненияКоманды.Окно,
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры       

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура Комплектация(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Источник);
	ПараметрыФормы.Вставить("ИмяМенеджераДокумента","КомплектацияЗапасов");
	
	КоличествоКомплектов = СозданиеНаОснованииВызовСервера.ПолучитьКоличествоКомплектов(Источник); 
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(
	"СоздатьКомплектацияЗаказовПослеУточнения",
	ЭтотОбъект,
	ПараметрыВыполненияКоманды);
	
	Если КоличествоКомплектов = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В Заказе покупателю нет комплектов для сборки'"),10);
	ИначеЕсли КоличествоКомплектов = 1 Тогда
		ОткрытьФорму("Документ.КомплектацияЗапасов.ФормаОбъекта",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Форма);
	Иначе
		ОткрытьФорму("ОбщаяФорма.СозданиеНаОснованииУточнениеКоличества",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Форма,,,,
		ОписаниеОповещенияОЗакрытии);
	КонецЕсли;
		
КонецПроцедуры       

// Открывает форму созданного на основании документа
// 
// Параметры:
//   Результат - Структура - сведения о выбранных параметрах количества
//       * АдресТовары - Строка - адрес сохраненной таблицы
//       * Основание - ДокументСсылка - ссылка на документ-основание
//       * КоличествоИзделий - Число - указанное количество
//   ДополнительныеПараметры - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура СоздатьКомплектацияЗаказовПослеУточнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Основание = Новый Структура();
	Основание.Вставить("АдресТовары", Результат.АдресТовары);
	Основание.Вставить("Основание", Результат.Основание);
	
	ПараметрыОткрытия = Новый Структура("Основание", Основание);
	Если Результат.КоличествоИзделий = 1 Тогда
		ОткрытьФорму("Документ.КомплектацияЗапасов.Форма.ФормаДокумента",
		ПараметрыОткрытия,
		,
		Новый УникальныйИдентификатор);
	Иначе
		МассивКомплектаций = СозданиеНаОснованииВызовСервера.СоздатьДокументыКомплектации(Основание); 
		
		Текст = НСтр("ru='Создание:'");
		Для каждого СтрокаКомплектация Из МассивКомплектаций Цикл
			
			ПоказатьОповещениеПользователя(Текст, ПолучитьНавигационнуюСсылку(СтрокаКомплектация), СтрокаКомплектация, БиблиотекаКартинок.Информация32);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму для заполнения сведений о доставке в Бизнес-сеть
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ЗаказНаДоставкуВ1СДоставка(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	Организация = СозданиеНаОснованииВызовСервера.ЗначениеРеквизитаОрганизация(Источник);
	
	ПараметрыЗаказа = Новый Структура;
	ПараметрыЗаказа.Вставить("ДокументОснование", Источник);
	ПараметрыЗаказа.Вставить("ТипГрузоперевозки", СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СДоставка());
	ПараметрыЗаказа.Вставить("ОрганизацияБизнесСети", Организация);
		
	СервисДоставкиКлиент.ОткрытьФормуКарточкиЗаказаНаДоставку(ПараметрыЗаказа);
		
КонецПроцедуры       

// Открывает форму для заполнения сведений о доставке в Бизнес-сеть
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ЗаказНаДоставкуВ1СКурьер(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	Организация = СозданиеНаОснованииВызовСервера.ЗначениеРеквизитаОрганизация(Источник);
	
	ПараметрыЗаказа = Новый Структура;
	ПараметрыЗаказа.Вставить("ДокументОснование", Источник);
	ПараметрыЗаказа.Вставить("ТипГрузоперевозки", СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СКурьер());
	ПараметрыЗаказа.Вставить("ОрганизацияБизнесСети", Организация);
		
	СервисДоставкиКлиент.ОткрытьФормуКарточкиЗаказаНаДоставку(ПараметрыЗаказа);
		
КонецПроцедуры       

// Открывает форму для заполнения сведений о доставке в Бизнес-сеть
// 
// Параметры:
//   Источник - ДокументСсылка - ссылка на документ, из которого вызывается команда
//   ПараметрыВыполненияКоманды - Структура - сведения о контексте исполнения:
//       * Форма - ФормаКлиентскогоПриложения - вызывающая форма
//       * Источник - ДанныеФормыСтруктура - сведения об основном объекте формы
//       * ТребуетсяЗапись - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяПроведение - Булево - необходимо ли выполнить действие при вызове данной команды
//       * ТребуетсяРаботаСФайлами - Булево - необходимо ли выполнить действие при вызове данной команды
//
Процедура ЗаказНаДоставкуВ1СКурьерика(Знач Источник, Знач ПараметрыВыполненияКоманды) Экспорт   
	
	Организация = СозданиеНаОснованииВызовСервера.ЗначениеРеквизитаОрганизация(Источник);
	
	ПараметрыЗаказа = Новый Структура;
	ПараметрыЗаказа.Вставить("ДокументОснование", Источник);
	ПараметрыЗаказа.Вставить("ТипГрузоперевозки", СервисДоставкиКлиентСервер.ТипГрузоперевозкиСервис1СКурьерика());
	ПараметрыЗаказа.Вставить("ОрганизацияБизнесСети", Организация);
		
	СервисДоставкиКлиент.ОткрытьФормуКарточкиЗаказаНаДоставку(ПараметрыЗаказа);
		
КонецПроцедуры       


// АПК:299-вкл

#КонецОбласти
